lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaRgbMoodLight/ZigbeeHaRgbMoodLight.ino
void applyReportingState() {
  if (!g_haveRestoredState || g_restoredState.reportingCount == 0U) {
    applyDefaultReporting();
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.reportingCount && i < 8U; ++i) {
    if (!g_restoredState.reporting[i].used) {
      continue;
    }
    g_device.configureReporting(g_restoredState.reporting[i].clusterId,
                                g_restoredState.reporting[i].attributeId,
                                g_restoredState.reporting[i].dataType,
                                g_restoredState.reporting[i].minimumIntervalSeconds,
                                g_restoredState.reporting[i].maximumIntervalSeconds,
                                g_restoredState.reporting[i].reportableChange);
  }
}

void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

static uint16_t levelToDutyPermille(uint16_t level) {
  uint16_t dutyPermille =
      static_cast<uint16_t>((static_cast<uint32_t>(level) * 1000UL) / 0xFEUL);
  if (dutyPermille == 0U && level > 0U) {
    dutyPermille = 1U;
  }
  return dutyPermille;
}

static uint16_t identifyDutyPermille(uint32_t nowMs, uint8_t effectIdentifier,
                                     uint16_t baseLevel) {
  if (baseLevel == 0U) {
    baseLevel = 0x80U;
  }
  const uint16_t baseDutyPermille = levelToDutyPermille(baseLevel);

  switch (effectIdentifier) {
    case kZigbeeIdentifyEffectBlink:
    case kZigbeeIdentifyEffectOkay:
      return (((nowMs / 150U) & 0x01UL) == 0U) ? baseDutyPermille : 0U;
    case kZigbeeIdentifyEffectBreathe: {
      const uint32_t phaseMs = nowMs % 1600UL;
      const uint32_t ramp = (phaseMs < 800UL) ? phaseMs : (1600UL - phaseMs);
      uint16_t dutyPermille = static_cast<uint16_t>(
          (static_cast<uint32_t>(baseDutyPermille) * ramp) / 800UL);
      if (dutyPermille == 0U && baseDutyPermille > 0U) {
        dutyPermille = 1U;
      }
      return dutyPermille;
    }
    case kZigbeeIdentifyEffectChannelChange:
      return (((nowMs / 75U) & 0x01UL) == 0U) ? baseDutyPermille : 0U;
    case kZigbeeIdentifyEffectFinishEffect:
      return baseDutyPermille;
    default:
      return (((nowMs / 250U) & 0x01UL) == 0U) ? baseDutyPermille : 0U;
  }
}

void applyLedState() {
  const uint32_t nowMs = millis();
  g_device.updateIdentify(nowMs);
  uint16_t dutyPermille = 0U;
  if (g_device.identifying()) {
    dutyPermille = identifyDutyPermille(nowMs, g_device.identifyEffect(),
                                        g_device.level());
  } else if (g_device.onOff()) {
    dutyPermille = levelToDutyPermille(g_device.level());
  }

  if (g_pwmReady) {
    (void)g_pwm20.setDutyPermille(dutyPermille);
    return;
  }

  (void)Gpio::write(kPinUserLed, dutyPermille == 0U);
}

void applyDefaultColorState() {
#if NRF54L15_CLEAN_ZIGBEE_COLOR_LIGHT
  (void)g_device.setColorHueSaturation(
      static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_DEFAULT_HUE),
      static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_DEFAULT_SATURATION));
#if NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE
#if NRF54L15_CLEAN_ZIGBEE_DEFAULT_USE_COLOR_TEMPERATURE
  (void)g_device.setColorTemperatureMireds(static_cast<uint16_t>(
      NRF54L15_CLEAN_ZIGBEE_DEFAULT_COLOR_TEMPERATURE_MIREDS));
#endif
#endif
#endif
}

[[maybe_unused]] void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME;
  basic.modelIdentifier = NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER;
  basic.swBuildId = NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID;
  basic.powerSource = 0x01U;
#if NRF54L15_CLEAN_ZIGBEE_COLOR_LIGHT
#if NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE
  g_device.configureExtendedColorLight(kLocalEndpoint, kIeeeAddress,
                                       g_localShort, g_panId, basic, 0x0000U,
                                       kDeviceLogicalType);
#else
  g_device.configureColorDimmableLight(kLocalEndpoint, kIeeeAddress,
                                       g_localShort, g_panId, basic, 0x0000U,
                                       kDeviceLogicalType);
#endif
#else
  g_device.configureDimmableLight(kLocalEndpoint, kIeeeAddress, g_localShort,
                                  g_panId, basic, 0x0000U,
                                  kDeviceLogicalType);
#endif
  applyReportingState();
  applyBindingState();
  (void)g_device.setLevel(g_savedLevelState);
  (void)g_device.setOnOff(g_savedOnOffState);
  applyDefaultColorState();
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, g_device.config().logicalType,
      g_device.config().manufacturerCode, &state);
  state.onOffState = g_device.onOff();
  state.levelState = g_device.level();

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  g_outgoingFrameCounters.stampPersistentState(&state);
  const bool saved = g_store.save(state);
  if (!saved) {
    g_persistentSecurityReady = false;
    g_outgoingFrameCounters.disable(ZigbeeOutgoingCounterDomain::kNwk);
    g_outgoingFrameCounters.disable(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
    g_outgoingFrameCounters.disable(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
  }
  return saved;
}

void restoreState() {
  g_restoredState = ZigbeePersistentState{};
  g_persistentSecurityReady = false;
  g_haveRestoredState = false;
  g_savedOnOffState = false;
  g_savedLevelState = 0x80U;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kLightShort,
                                                kCoordinatorShort,
                                                kDeviceLogicalType);

