lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaRgbMoodLight/ZigbeeHaRgbMoodLight.ino
  const uint32_t now = millis();
  const ZigbeeCommissioningAction action =
      ZigbeeCommissioning::nextAction(&g_network, now);
  const uint32_t effectivePollIntervalMs =
      interviewGraceActive(now) ? min(g_parentPollIntervalMs, 250UL)
                                : g_parentPollIntervalMs;
  if (!g_joined) {
    clearPendingApsAck();
    clearRecentInboundAps();
    if (action == ZigbeeCommissioningAction::kPollParent &&
        (now - g_lastPollMs) >= 250U) {
      g_lastPollMs = now;
      pollCoordinator();
    } else if (action == ZigbeeCommissioningAction::kSecureRejoin) {
      Serial.print("secure_rejoin start\r\n");
      if (performSecureRejoin()) {
        Serial.print("secure_rejoin OK ch=");
      } else {
        Serial.print("secure_rejoin MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    } else if (action == ZigbeeCommissioningAction::kJoin) {
      Serial.print("scan_join start\r\n");
      if (!performJoin()) {
        Serial.print("join MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print("join OK ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    }
    maybeReceiveDirectInterviewTraffic(now);
    delay(1);
    return;
  }

  if (action == ZigbeeCommissioningAction::kRequestEndDeviceTimeout) {
    const bool ok = sendEndDeviceTimeoutRequest();
    Serial.print("end_device_timeout_req ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  } else if (action == ZigbeeCommissioningAction::kSendDeviceAnnounce) {
    const bool ok = sendDeviceAnnounce();
    Serial.print("device_announce ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  }

  if (usesParentPolling() && (now - g_lastPollMs) >= effectivePollIntervalMs) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  maybeReceiveDirectInterviewTraffic(now);
  maybeExpirePendingApsAck(now);
  maybeSendScheduledReports(now);
  applyLedState();

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" nwk_seq=");
    Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
    Serial.print(" poll_ms=");
    Serial.print(g_parentPollIntervalMs);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "ON" : "OFF");
    Serial.print(" level=");
    Serial.print(g_device.level());
    Serial.print("\r\n");
  }

  delay(1);
}
